// https://school.programmers.co.kr/learn/courses/30/lessons/12914

// n = 1
// [1]

// n = 2
// [1, 1]
// [2]

// n = 3
// [1, 1, 1]
// [1, 2]
// [2, 1]

// n = 4
// [1, 1, 1, 1]
// [1, 1, 2]
// [1, 2, 1]
// [2, 1, 1]
// [2, 2]

// n = 5
// [1, 1, 1, 1, 1]
// [1, 1, 1, 2]
// [1, 1, 2, 1]
// [1, 2, 1, 1]
// [2, 1, 1, 1]
// [1, 2, 2]
// [2, 2, 1]
// [2, 1, 2]

// fn(3) = fn(2) + fn(1) = 2개 + 1개 = 3개
// fn(4) = fn(3) + fn(2) = 3개 + 2개 = 5개
// fn(5) = fn(4) + fn(3) = 5개 + 3개 = 8개
// fn(n) = fn(n-1) + fn(n-2)

function solution(n){
  const arr = [0, 1, 2];

  for(let i = 3; i <= n; i++){
    arr[i] = (arr[i-1] + arr[i-2]) % 1234567;
  }

  return arr[n];
}